<?php
 # Author - MI SHAJIB
 include 'header.php'; #include header file
?>
<div class="card-body" style="background: <?php echo '#ddd';?>; color: #000;">
<?php
  # এক্সেপশন কি
  /*
  কোড এক্সিকিউশনের সময় কোনো নির্দিষ্ট error বা ব্যতিক্রমধর্মী কন্ডিশনের সৃষ্টি হলে, কোড এক্সিকিউশন(execution)-র স্বাভাবিক ধারাকে পরিবর্তন করার জন্য এক্সেপশন(Exception) ব্যবহার করা হয়। এই কন্ডিশন(conditon)-কে এক্সেপশন বলা হয়।

  পিএইচপি ৫ আসার পরে error নিয়ন্ত্রণে নতুন মাত্রা হিসাবে অবজেক্ট ওরিয়েন্টেড পদ্ধতি যোগ হয়েছে।


  এক্সেপশনের উৎপত্তি হলে সাধারণত নিচের বিষয়সমূহ সংঘটিত হয়ঃ

  সাম্প্রতিক কোডের ফিল্ড সংরক্ষিত হয়।
  কোডের এক্সিকিউশন বর্তমান অবস্থা থেকে পূর্ব নির্ধারিত বা কাস্টম এক্সেপশন হ্যান্ডেলার ফাংশনের কাছে সুইচ করবে।
  পরিস্থিতির উপর ভিত্তিকরে হ্যান্ডেলার সংরক্ষিত কোডের ফিল্ড থেকে এক্সিকিউশন চালু করতে পারে, স্ক্রিপ্ট এক্সিকিউশন শেষ করে দিতে পারে অথবা ভিন্ন লোকেশন থেকে স্ক্রিপ্ট চলমান রাখতে পারে।
  এই অধ্যায়ে নিম্নোক্ত error হ্যান্ডেলিং মেথডসমূহ নিয়ে আলোচনা করবোঃ

  এক্সেপশনের মৌলিক ব্যবহার
  কাস্টম(custom) এক্সেপশন হ্যান্ডেলার তৈরি
  মাল্টিপল(Multiple) এক্সেপশন
  এক্সেপশনকে পুনরায় নিক্ষেপ(Re-throwing) করা
  টপ লেভেলের এক্সেপশন হ্যান্ডেলার সেট করা
  বিঃদ্রঃ শুধুমাত্র error কন্ডিশন নিয়ে কাজ করার জন্য এক্সেপশন ব্যবহার করা উচিৎ। কোনো নির্দিষ্ট পয়েন্টে এক স্থান থেকে অন্য স্থানে লাফ দিয়ে যাওয়ার জন্য এটি ব্যবহার করা উচিৎ নয়।

  এক্সেপশনের মৌলিক ব্যবহার
  যখন কোনো এক্সেপশন নিক্ষিপ্ত হয় তখন এটিতে যে কোড থাকে তা সম্পাদিত(executed) হয় না, এক্ষেত্রে পিএইচপি এর সাথে মিলসম্পন্ন ক্যাচ( "catch") ব্লককে খুঁজে বের করার চেষ্টা করে।

  যদি কোনো এক্সেপশন ধরতে না পারে তাহলে Uncaught Exception ম্যাসেজের মাধ্যমে মারাত্মক ভুল(fatal error) প্রেরণ করবে।
  */
  function numcheck($num){
    if ($num > 1) {
      throw new Exception("Value must be 1 or below");

    }
    return true;
  }
  try {
    numcheck(2);
    echo "It you see this, the number is 1 or below";
  } catch (Exception $e) {
    echo "Message: ". $e->getMessage();
  }

?>
<?php
  include 'footer.php'; #include footer file
?>
